chence1219/nertc-iot-demo/esp32/nertc_demo/main/audio/audio_service.cc
#include "audio_service.h"
#include <esp_log.h>
#include <cstring>
#include <limits>
#include "application.h"

#define RATE_CVT_CFG(_src_rate, _dest_rate, _channel)        \
    (esp_ae_rate_cvt_cfg_t)                                  \
    {                                                        \
        .src_rate        = (uint32_t)(_src_rate),            \
        .dest_rate       = (uint32_t)(_dest_rate),           \
        .channel         = (uint8_t)(_channel),              \
        .bits_per_sample = ESP_AUDIO_BIT16,                  \
        .complexity      = 2,                                \
        .perf_type       = ESP_AE_RATE_CVT_PERF_TYPE_SPEED,  \
    }

#define OPUS_DEC_CFG(_sample_rate, _frame_duration_ms)                                                    \
    (esp_opus_dec_cfg_t)                                                                                  \
    {                                                                                                     \
        .sample_rate    = (uint32_t)(_sample_rate),                                                       \
        .channel        = ESP_AUDIO_MONO,                                                                 \
        .frame_duration = (esp_opus_dec_frame_duration_t)AS_OPUS_GET_FRAME_DRU_ENUM(_frame_duration_ms),  \
        .self_delimited = false,                                                                          \
    }

#if CONFIG_USE_AUDIO_PROCESSOR
#include "processors/afe_audio_processor.h"
#include "processors/pure_afe_audio_processor.h"
#else
#include "processors/no_audio_processor.h"
#endif

#if CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32P4
#include "wake_words/afe_wake_word.h"
#include "wake_words/custom_wake_word.h"
#include "wake_words/nertc_afe_wake_word.h"
#else
#include "wake_words/esp_wake_word.h"
#endif

#ifdef CONFIG_CONNECTION_TYPE_NERTC
#include "../protocols/nertc_protocol.h"
#endif

#define TAG "AudioService"

namespace {
constexpr float kPlaybackLimiterCeiling = 0.891250938f;   // 10^(-1/20), ~ -1 dBFS
constexpr float kPlaybackLimiterAttackBypass = 0.85f;     // below this peak, skip limiter path
constexpr float kPlaybackFrameReleaseStep = 0.03f;        // per-frame gain recovery step
}  // namespace

AudioService::AudioService() {
    event_group_ = xEventGroupCreate();
}

AudioService::~AudioService() {
    if (event_group_ != nullptr) {
        vEventGroupDelete(event_group_);
    }
    if (opus_encoder_ != nullptr) {
        esp_opus_enc_close(opus_encoder_);
    }
    if (opus_decoder_ != nullptr) {
        esp_opus_dec_close(opus_decoder_);
    }
#ifdef CONFIG_USE_AUDIO_CODEC_ENCODE_OPUS
    if (opus_decoder2_ != nullptr) {
        esp_opus_dec_close(opus_decoder2_);
    }   
#endif
    if (input_resampler_ != nullptr) {
        esp_ae_rate_cvt_close(input_resampler_);
    }
    if (output_resampler_ != nullptr) {
        esp_ae_rate_cvt_close(output_resampler_);
    }
}

void AudioService::ResetOpusParameters() {
    opus_frame_duration_ = OPUS_FRAME_DURATION_MS;
#ifdef CONFIG_CONNECTION_TYPE_NERTC
    auto* config_json = NeRtcProtocol::ReadConfigJson();
    if(config_json) {
        cJSON* audio_config = cJSON_GetObjectItem(config_json, "audio_config");
        if (audio_config) {
            cJSON* frame_size = cJSON_GetObjectItem(audio_config, "frame_size");
            if (cJSON_IsNumber(frame_size)) {
                opus_frame_duration_ = frame_size->valueint;
            }
        }
    }
#endif
#if defined(CONFIG_USE_DEVICE_AEC) && !defined(CONFIG_USE_AUDIO_CODEC_ENCODE_OPUS)
    max_send_packets_size_ = (960 / opus_frame_duration_);
#else
    max_send_packets_size_ = (600 / opus_frame_duration_);
#endif
    max_decode_packets_size_ = (600 / opus_frame_duration_);
    ESP_LOGI(TAG, "opus_frame_duration_: %d", opus_frame_duration_);
}


void AudioService::Initialize(AudioCodec* codec) {
#if CONFIG_CONNECTION_TYPE_NERTC
    ResetOpusParameters();
#endif
    codec_ = codec;
    codec_->SetOpusFrameDuration(opus_frame_duration());
    codec_->Start();

    /* Setup the audio codec */
    esp_opus_dec_cfg_t opus_dec_cfg = OPUS_DEC_CFG(codec->output_sample_rate(), opus_frame_duration());
    auto ret = esp_opus_dec_open(&opus_dec_cfg, sizeof(esp_opus_dec_cfg_t), &opus_decoder_);
    if (opus_decoder_ == nullptr) {
        ESP_LOGE(TAG, "Failed to create audio decoder, error code: %d", ret);
    } else {
        decoder_sample_rate_ = codec->output_sample_rate();
        decoder_duration_ms_ = opus_frame_duration();
        decoder_frame_size_ = decoder_sample_rate_ / 1000 * opus_frame_duration();
    }
#ifdef CONFIG_USE_AUDIO_CODEC_ENCODE_OPUS
#if defined (CONFIG_IDF_TARGET_ESP32S3) || defined(CONFIG_IDF_TARGET_ESP32P4)
    if (opus_decoder2_ == nullptr) {
        esp_opus_dec_cfg_t wake_opus_dec_cfg = OPUS_DEC_CFG(16000, 20);
        auto ret2 = esp_opus_dec_open(&wake_opus_dec_cfg, sizeof(esp_opus_dec_cfg_t), &opus_decoder2_);
        if (opus_decoder2_ == nullptr) {
            ESP_LOGE(TAG, "Failed to create wake word audio decoder, error code: %d", ret2);
        } else {
            ESP_LOGI(TAG, "Wake word opus decoder created successfully");
        }
    }   
#endif
#else
    esp_opus_enc_config_t opus_enc_cfg = AS_OPUS_ENC_CONFIG_BY_DURATION(opus_frame_duration());
    ret = esp_opus_enc_open(&opus_enc_cfg, sizeof(esp_opus_enc_config_t), &opus_encoder_);
    if (opus_encoder_ == nullptr) {
        ESP_LOGE(TAG, "Failed to create audio encoder, error code: %d", ret);
    } else {
        encoder_sample_rate_ = 16000;
        encoder_duration_ms_ = opus_frame_duration();
        esp_opus_enc_get_frame_size(opus_encoder_, &encoder_frame_size_, &encoder_outbuf_size_);
        encoder_frame_size_ = encoder_frame_size_ / sizeof(int16_t);
    }
#endif

    if (codec->input_sample_rate() != 16000) {
        esp_ae_rate_cvt_cfg_t input_resampler_cfg = RATE_CVT_CFG(
            codec->input_sample_rate(), ESP_AUDIO_SAMPLE_RATE_16K, codec->input_channels());
        auto resampler_ret = esp_ae_rate_cvt_open(&input_resampler_cfg, &input_resampler_);
        if (input_resampler_ == nullptr) {
            ESP_LOGE(TAG, "Failed to create input resampler, error code: %d", resampler_ret);
        }
    }

#if CONFIG_USE_AUDIO_PROCESSOR
#if defined(CONFIG_USE_DEVICE_AEC) && !defined(CONFIG_USE_AUDIO_CODEC_ENCODE_OPUS)
    if(codec->input_channels() == 1 && !codec->input_reference())
    {
        ESP_LOGI(TAG, "Using Pure AFE audio processor");
        audio_processor_ = std::make_unique<PureAfeAudioProcessor>();
    }
    else
    {
#endif 
        ESP_LOGI(TAG, "Using AFE audio processor");
        audio_processor_ = std::make_unique<AfeAudioProcessor>();
#if defined(CONFIG_USE_DEVICE_AEC) && !defined(CONFIG_USE_AUDIO_CODEC_ENCODE_OPUS)
    }
#endif
#else
    audio_processor_ = std::make_unique<NoAudioProcessor>();
#endif

    audio_processor_->OnOutput([this](std::vector<int16_t>&& data) {
        PushTaskToEncodeQueue(kAudioTaskTypeEncodeToSendQueue, std::move(data));
    });

