chence1219/nertc-iot-demo/esp32/nertc_demo/main/audio/audio_service.cc
    return true;
}

void AudioService::AudioInputTask() {
    while (true) {
        EventBits_t bits = xEventGroupWaitBits(event_group_, AS_EVENT_AUDIO_TESTING_RUNNING |
            AS_EVENT_WAKE_WORD_RUNNING | AS_EVENT_AUDIO_PROCESSOR_RUNNING,
            pdFALSE, pdFALSE, portMAX_DELAY);

        if (service_stopped_) {
            break;
        }
        if (audio_input_need_warmup_) {
            audio_input_need_warmup_ = false;
            vTaskDelay(pdMS_TO_TICKS(120));
            continue;
        }
#if (defined(CONFIG_USE_AUDIO_CODEC_ENCODE_OPUS) || defined(CONFIG_USE_AUDIO_CODEC_DECODE_OPUS))
#else
        /* Used for audio testing in NetworkConfiguring mode by clicking the BOOT button */
        if (bits & AS_EVENT_AUDIO_TESTING_RUNNING) {
            if (audio_testing_queue_.size() >= AUDIO_TESTING_MAX_DURATION_MS / opus_frame_duration()) {
                ESP_LOGW(TAG, "Audio testing queue is full, stopping audio testing");
                EnableAudioTesting(false);
                continue;
            }
            std::vector<int16_t> data;
            int samples = opus_frame_duration() * 16000 / 1000;
            if (ReadAudioData(data, 16000, samples)) {
                // If input channels is 2, we need to fetch the left channel data
                if (codec_->input_channels() == 2) {
                    auto mono_data = std::vector<int16_t>(data.size() / 2);
                    for (size_t i = 0, j = 0; i < mono_data.size(); ++i, j += 2) {
                        mono_data[i] = data[j];
                    }
                    data = std::move(mono_data);
                }
                PushTaskToEncodeQueue(kAudioTaskTypeEncodeToTestingQueue, std::move(data));
                continue;
            }
        }
#endif

        /* Feed the wake word */
        if (bits & AS_EVENT_WAKE_WORD_RUNNING) {
#if defined(CONFIG_USE_AUDIO_CODEC_ENCODE_OPUS) && (defined(CONFIG_IDF_TARGET_ESP32S3) || defined(CONFIG_IDF_TARGET_ESP32P4))
            OnAudioInputDecodeForWakeWord();
            continue;
#else
            std::vector<int16_t> data;
            int samples = wake_word_->GetFeedSize(); // 160; // 10ms
            if (samples <= 0) {
                samples = 160; // 10ms;
            }
            if (ReadAudioData(data, 16000, samples)) {
                wake_word_->Feed(data);
                continue;
            }
#endif
        }

        /* Feed the audio processor */
        if (bits & AS_EVENT_AUDIO_PROCESSOR_RUNNING) {
#ifdef CONFIG_USE_AUDIO_CODEC_ENCODE_OPUS
            std::vector<uint8_t> data;
            int samples = opus_frame_duration() * 16000 / 1000;
            if (samples > 0) {
                if (ReadAudioData(data, 16000, samples)) {
                    if (audio_send_queue_.size() < max_send_packets_size_) {
                        auto packet = std::make_unique<AudioStreamPacket>();
                        packet->payload = std::move(data);
                        packet->frame_duration = opus_frame_duration();
                        packet->sample_rate = 16000;
                        {
                            std::lock_guard<std::mutex> lock(audio_queue_mutex_);
                            audio_send_queue_.push_back(std::move(packet));
                        }
                        if (callbacks_.on_send_queue_available) {
                            callbacks_.on_send_queue_available();
                        }
                    }
                    continue;
                }
            }
#else
            std::vector<int16_t> data;
            int samples = audio_processor_->GetFeedSize();
            if (samples > 0) {
                if (ReadAudioData(data, 16000, samples)) {
                    audio_processor_->Feed(std::move(data));
                }
                continue;
            }
#endif
        }

        ESP_LOGE(TAG, "Should not be here, bits: %lx", bits);
        break;
    }

    ESP_LOGW(TAG, "Audio input task stopped");
}

void AudioService::AudioOutputTask() {
    while (true) {
        std::unique_lock<std::mutex> lock(audio_queue_mutex_);
        audio_queue_cv_.wait(lock, [this]() { return !audio_playback_queue_.empty() || service_stopped_; });
        if (service_stopped_) {
            break;
        }

        auto task = std::move(audio_playback_queue_.front());
        audio_playback_queue_.pop_front();
        audio_queue_cv_.notify_all();
        lock.unlock();

        if (!codec_->output_enabled()) {
            esp_timer_stop(audio_power_timer_);
            esp_timer_start_periodic(audio_power_timer_, AUDIO_POWER_CHECK_INTERVAL_MS * 1000);
            codec_->EnableOutput(true);
        }

        codec_->OutputData(task->pcm);
#if CONFIG_CONNECTION_TYPE_NERTC
        if (task->nertc_playback_start_timestamp_ms > 0) {
            const int64_t now_ms = esp_timer_get_time() / 1000;
            if (now_ms >= task->nertc_playback_start_timestamp_ms) {
                const int64_t latency_ms64 = now_ms - task->nertc_playback_start_timestamp_ms;
                const int latency_ms = latency_ms64 > std::numeric_limits<int>::max()
                                           ? std::numeric_limits<int>::max()
                                           : static_cast<int>(latency_ms64);
                ESP_LOGI(TAG, "AI playback local latency: %d ms", latency_ms);
            }
        }
#endif
        auto uxNow = xEventGroupGetBits(event_group_);
        if(uxNow & AS_EVENT_AUDIO_PROCESSOR_RUNNING)
        {
            audio_processor_->InputReferenceAudio(task->pcm);
        }
        /* Update the last output time */
        last_output_time_ = std::chrono::steady_clock::now();
        debug_statistics_.playback_count++;

#if CONFIG_USE_SERVER_AEC
        /* Record the timestamp for server AEC */
        if (task->timestamp > 0) {
            lock.lock();
            timestamp_queue_.push_back(task->timestamp);
        }
#endif
    }

    ESP_LOGW(TAG, "Audio output task stopped");
}

void AudioService::OpusCodecTask() {
    while (true) {
        std::unique_lock<std::mutex> lock(audio_queue_mutex_);
        audio_queue_cv_.wait(lock, [this]() {
            return service_stopped_ ||
                (!audio_encode_queue_.empty() && audio_send_queue_.size() < max_send_packets_size_) ||
                (!audio_decode_queue_.empty() && audio_playback_queue_.size() < MAX_PLAYBACK_TASKS_IN_QUEUE);
        });
        if (service_stopped_) {
            break;
        }

        /* Decode the audio from decode queue */
        if (!audio_decode_queue_.empty() && audio_playback_queue_.size() < MAX_PLAYBACK_TASKS_IN_QUEUE) {
            auto packet = std::move(audio_decode_queue_.front());
            audio_decode_queue_.pop_front();
            audio_queue_cv_.notify_all();
            lock.unlock();

