chence1219/nertc-iot-demo/esp32/nertc_demo/main/audio/audio_service.cc
    audio_processor_->EnableDeviceAec(enable);
}

void AudioService::SetCallbacks(AudioServiceCallbacks& callbacks) {
    callbacks_ = callbacks;
}

void AudioService::PlaySound(const std::string_view& ogg) {
    if (!codec_->output_enabled()) {
        esp_timer_stop(audio_power_timer_);
        esp_timer_start_periodic(audio_power_timer_, AUDIO_POWER_CHECK_INTERVAL_MS * 1000);
        codec_->EnableOutput(true);
    }

    const auto* buf = reinterpret_cast<const uint8_t*>(ogg.data());
    size_t size = ogg.size();

    auto demuxer = std::make_unique<OggDemuxer>();
    demuxer->OnDemuxerFinished([this](const uint8_t* data, int sample_rate, size_t size){
        auto packet = std::make_unique<AudioStreamPacket>();
        packet->sample_rate = sample_rate;
        packet->frame_duration = 60;
        packet->payload.resize(size);
        std::memcpy(packet->payload.data(), data, size);
        PushPacketToDecodeQueue(std::move(packet), true);
    });
    demuxer->Reset();
    demuxer->Process(buf, size);
}

bool AudioService::IsIdle() {
    std::lock_guard<std::mutex> lock(audio_queue_mutex_);
    return audio_encode_queue_.empty() && audio_decode_queue_.empty() && audio_playback_queue_.empty() && audio_testing_queue_.empty();
}

void AudioService::WaitForPlaybackQueueEmpty() {
    std::unique_lock<std::mutex> lock(audio_queue_mutex_);
    audio_queue_cv_.wait(lock, [this]() { 
        return service_stopped_ || (audio_decode_queue_.empty() && audio_playback_queue_.empty()); 
    });
}

void AudioService::ResetDecoder() {
    std::lock_guard<std::mutex> lock(audio_queue_mutex_);
    std::unique_lock<std::mutex> decoder_lock(decoder_mutex_);
    if (opus_decoder_ != nullptr) {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 5, 0)
        esp_opus_dec_reset(opus_decoder_);
#else
        if (opus_decoder_ != nullptr) {
            esp_opus_dec_close(opus_decoder_);
            opus_decoder_ = nullptr;
        }
        esp_opus_dec_cfg_t opus_dec_cfg = OPUS_DEC_CFG(decoder_sample_rate_, decoder_duration_ms_);
        auto ret = esp_opus_dec_open(&opus_dec_cfg, sizeof(esp_opus_dec_cfg_t), &opus_decoder_);
        if (opus_decoder_ == nullptr) {
            ESP_LOGE(TAG, "Failed to create audio decoder, error code: %d", ret);
        }
#endif
    }
    decoder_lock.unlock();
    timestamp_queue_.clear();
    audio_decode_queue_.clear();
    audio_playback_queue_.clear();
    audio_testing_queue_.clear();
    audio_queue_cv_.notify_all();
}

void AudioService::CheckAndUpdateAudioPowerState() {
    auto now = std::chrono::steady_clock::now();
    auto input_elapsed = std::chrono::duration_cast<std::chrono::milliseconds>(now - last_input_time_).count();
    auto output_elapsed = std::chrono::duration_cast<std::chrono::milliseconds>(now - last_output_time_).count();
    if (input_elapsed > AUDIO_POWER_TIMEOUT_MS && codec_->input_enabled()) {
        codec_->EnableInput(false);
    }
    if (output_elapsed > AUDIO_POWER_TIMEOUT_MS && codec_->output_enabled()) {
        codec_->EnableOutput(false);
    }
    if (!codec_->input_enabled() && !codec_->output_enabled()) {
        esp_timer_stop(audio_power_timer_);
    }
}

void AudioService::SetModelsList(srmodel_list_t* models_list) {
    models_list_ = models_list;

#if CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32P4
    if (Application::GetInstance().IsOtaWakeWordCreationDisabled()) {
        wake_word_ = nullptr;
        return;
    }
    if (esp_srmodel_filter(models_list_, ESP_MN_PREFIX, NULL) != nullptr) {
        wake_word_ = std::make_unique<NertcAfeWakeWord>();
    } else if (esp_srmodel_filter(models_list_, ESP_WN_PREFIX, NULL) != nullptr) {
        wake_word_ = std::make_unique<AfeWakeWord>();
    } else {
        wake_word_ = nullptr;
    }
#else
    if (esp_srmodel_filter(models_list_, ESP_WN_PREFIX, NULL) != nullptr) {
        wake_word_ = std::make_unique<EspWakeWord>();
    } else {
        wake_word_ = nullptr;
    }
#endif

    if (wake_word_) {
        wake_word_->OnWakeWordDetected([this](const std::string& wake_word) {
            if (callbacks_.on_wake_word_detected) {
                callbacks_.on_wake_word_detected(wake_word);
            }
        });
    }
}

void AudioService::UpdateLastOutputTime(){
    last_output_time_ =  std::chrono::steady_clock::now();
}

bool AudioService::IsAfeWakeWord() {
#if CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32P4
    return wake_word_ != nullptr && dynamic_cast<AfeWakeWord*>(wake_word_.get()) != nullptr;
#else
    return false;
#endif
}

#ifdef CONFIG_USE_AUDIO_CODEC_ENCODE_OPUS
void AudioService::WakeOpusCodecTask() {
    while (true) {
        {
            std::unique_lock<std::mutex> lock(wake_audio_queue_mutex_);
            wake_audio_queue_cv_.wait(lock, [this]() {
                return !service_stopped_ && wake_word_opus_queue_.size() > 0;
            });
        }   
        if (!wake_word_opus_queue_.empty()) {
            std::unique_lock<std::mutex> lock(wake_audio_queue_mutex_);
            auto data = std::move(wake_word_opus_queue_.front());
            wake_word_opus_queue_.pop_front();
            wake_audio_queue_cv_.notify_all();
            lock.unlock();
            // if (opus_decoder2_->Decode(std::move(data), pcm)) {
            //     std::unique_lock<std::mutex> lock(wake_wake_pcm_buffer_mutex_);
            //     wake_pcm_buffer_.insert(wake_pcm_buffer_.end(), pcm.begin(), pcm.end());
            //     lock.unlock();
            // }
            if (opus_decoder2_) {
                std::vector<int16_t> pcm;
                pcm.resize(320); // 20ms 16000Hz mono
                esp_audio_dec_in_raw_t raw = {
                    .buffer = data.data(),
                    .len = (uint32_t)data.size(),
                    .consumed = 0,
                    .frame_recover = ESP_AUDIO_DEC_RECOVERY_NONE,
                };
                esp_audio_dec_out_frame_t out_frame = {
                    .buffer = (uint8_t*)pcm.data(),
                    .len = (uint32_t)(pcm.size() * sizeof(int16_t)),
                    .decoded_size = 0,
                };
                esp_audio_dec_info_t dec_info = {};
                auto ret = esp_opus_dec_decode(opus_decoder2_, &raw, &out_frame, &dec_info);
                if (ret == ESP_AUDIO_ERR_OK) {
                    pcm.resize(out_frame.decoded_size / sizeof(int16_t));
                    std::memcpy(pcm.data(), out_frame.buffer, out_frame.decoded_size);
                    std::unique_lock<std::mutex> lock(wake_wake_pcm_buffer_mutex_);
                    wake_pcm_buffer_.insert(wake_pcm_buffer_.end(), pcm.begin(), pcm.end());
                    lock.unlock();
                } else {
                    ESP_LOGE(TAG, "Failed to decode wake word audio, error code: %d", ret);
                }
            }
        }
    }
}
#endif

